#include<stdio.h>

// TODO    /* 함수 선언부 */
int controlMenu(void);
void fanOn(unsigned char *fan);
void fanOff(unsigned char *fan);
void fanReverse(unsigned char *fan);
void display(unsigned char fan_set);

/*--------------------------------------------------------------------------*/
/*                               main() 함수                                */
/*--------------------------------------------------------------------------*/
int main()
{
	unsigned char fan_set=0; /* fan의 상태를 저장하는 변수 : bit의 값이 0이면 off상태를 나타내고,
					   1이면 on상태를 나타냄 시작할때에는 8개의 fan이 모두 off인 상태로 시작 함 */
	int res=0;     /* 선택된 메뉴번호 저장 변수 */

	while(1)
	{
		res=controlMenu(); /* 메뉴 출력 및 메뉴 선택 */
		if(res==4){ /* 종료 메뉴 선택시 반복문 종료 */
			break;
		}
		switch(res){  /* 1~3번 메뉴 선택시 해당 함수 수행 */
			case 1 : // TODO   /* 환풍기 열기 함수 호출 */
			    fanOn(&fan_set);
				     break;
			case 2 : // TODO   /* 환풍기 닫기 함수 호출 */
				     fanOff(&fan_set);
				     break;
			case 3 : // TODO   /* 환풍기 전체 전환 함수 호출 */
				     fanReverse(&fan_set);
				     break;
		}
		// TODO         /* 환풍기 상태 화면 출력 */
		display(fan_set);
	}
	return 0;
}
/*--------------------------------------------------------------------------*/
/*                     Number select Menu 처리 함수                         */
/*--------------------------------------------------------------------------*/
int controlMenu(void)
{
	int number;
	while(1)
	{
		/* 메뉴 출력하기 */
		printf("1. 환풍구 열기 / 2. 환풍구 닫기 / 3. 환풍구 전체 전환 / 4. 종료 : ");

		scanf("%d", &number); /* 메뉴 입력 */

		if(1<=number && number<=4){ /* 입력된 메뉴번호가 1~4번 메뉴이면 반복문 탈출 */
			break;
		}
		else{  /* 잘못된 메뉴번호 입력시 재입력 요구 메세지 출력 */
			printf("잘못 입력하셨습니다. 다시 입력하세요.\n\n");
		}
	}
	return number;
}
/*--------------------------------------------------------------------------*/
/*                     환풍구 열기 작업  처리 함수                          */
/*--------------------------------------------------------------------------*/

void fanOn(unsigned char *fan){ 
    int bitMask = 0x01;
    int fanNum = 0;
    printf("------------------------------------------------\n");
    printf("              Fan 열기 작업 실행 화면\n");
    printf("------------------------------------------------\n");
    printf(" * OPEN할 FAN 번호를 입력하시오 (1-8) : ");
    scanf("%d",&fanNum);

    bitMask <<= (fanNum-1);

    *fan = (*fan) | bitMask;
}


/*--------------------------------------------------------------------------*/
/*                     환풍구 닫기 작업  처리 함수                          */
/*--------------------------------------------------------------------------*/

void fanOff(unsigned char *fan){
    int bitMask = 0x01;
    int fanNum = 0;
    printf("------------------------------------------------\n");
    printf("              Fan 닫기 작업 실행 화면\n");
    printf("------------------------------------------------\n");
    printf(" * CLOSE할 FAN 번호를 입력하시오 (1-8) : ");
    scanf("%d",&fanNum);

    bitMask <<= (fanNum-1);

    bitMask = ~bitMask;
    *fan = (*fan) & bitMask;

}


/*--------------------------------------------------------------------------*/
/*     환풍구 전체 전환(열린것은 닫고, 닫힌것은 열어 줌) 작업 처리 함수     */
/*--------------------------------------------------------------------------*/

void fanReverse(unsigned char *fan){
    int i = 0;
    printf("------------------------------------------------\n");
    printf("              Fan 전체 전환 작업 실행 화면\n");
    printf("------------------------------------------------\n");
    *fan = ~*fan;
    printf("              전체 FAN의 상태가 전환되었습니다. (ON, OFF 상태 뒤바뀜)\n");


}

/*--------------------------------------------------------------------------*/
/*                     환풍구 On, Off 상태 출력 함수                        */
/*--------------------------------------------------------------------------*/

void display(unsigned char fan_set){
   int i = 0;
   unsigned char check = 0x80;
   
   printf("\n------------------------------------------------\n");
   
   for (i = 8; i > 0 ; i--){
       printf("%d번FAN  ",i);
   }
   printf("\n");
   for (i = 0; i < 8 ; i++){
       if (fan_set & check){
	   printf("    ON  ");
       }
       else {
	   printf("   OFF  ");
       }
       check >>= 1;
   }
   printf("\n");

   printf("------------------------------------------------\n");
}


